<template>
  <div class="term-wrap" v-if="visible">
    <div class="term" v-clickoutside="closeTerm">
      <header class="term-header">
        <h3 class="term-header-title">维鹰云服务条款</h3>
        <span class="term-header-close" title="关闭" @click="closeTerm">
          <img class="term-header-close--icon" src="../../assets/images/auth/close.svg" alt="关闭" />
        </span>
      </header>
      <section class="term-section">
        <div class="content">
          <h3 style="text-align: center">维鹰云服务条款</h3>
          <br />
          <p style="font-size: 14px">
            维鹰云服务是由腾云悦智科技（深圳）有限责任公司（以下简称“本公司”）向用户（以下简称“您”）提供的监控管理云服务，详见aiops.yz-intelligence.com（以下简称“本网站”）。本协议由您和本公司签订。
          </p>
          <h3>1. 总则</h3>
          <p>
            1.1
            您确认：您在使用本服务之前，已充分阅读、理解并接受本协议的全部内容，一旦您选择“提交申请”并完成注册或使用本服务，即表示您同意遵循本协议之所有约定。<br />
            1.2
            您同意：本公司有权随时对本协议及相应的服务规则内容进行单方面的变更，并以消息推送、网页公告等方式予以公布，无需另行单独通知您；若您在本协议内容公告变更后继续使用本服务的，表示您已充分阅读、理解并接受修改后的协议内容，也将遵循修改后的协议内容使用本服务；若您不同意修改后的协议内容，您应立即停止使用本服务。<br />
            1.3
            您承诺：您将本着合法、合理、善意的目的使用本服务，不利用本服务进行任何违法、侵害他人合法利益、恶意的行为。
          </p>
          <h3>2. 账户</h3>
          <p>
            2.1 注册<br />
            2.1.1 注册者资格<br />
            您确认，在您完成注册程序或以其他本公司允许的方式实际使用本服务时，您应当是具备完全民事权利能力和完全民事行为能力的自然人、法人或其他组织。若您不具备前述主体资格，则您及您的监护人、设立人应承担因此而导致的一切后果，且本公司有权注销您的账户、停止向您提供服务并删除您在维鹰云服务过程中产生的一切数据，并向您及您的监护人、设立人索偿。<br />
            2.1.2 注册和账户<br />
            2.1.2.1
            在您按照申请页面提示填写信息、阅读并同意本协议且完成全部申请程序后，或您以其他本公司允许的方式实际使用本网站服务时，您即受本协议约束。<br />
            2.1.2.2 您了解并同意，您在本网站完成的申请程序并申请成功后，您即已获得本服务用户名及密码。<br />
            2.1.2.3
            申请试用、免费测试为注册的形式之一，试用及测试的目的在于让您在一定时间内免费体验本服务从而获得您的认可，达成合作及服务。<br />
            2.1.2.4
            默认立即开通。您在此明确授权，您的账户信息在您注册成功时，已授权本网站披露给本公司及关联公司，以使您更便捷地使用本服务。<br />
            2.1.3 信息<br />
            2.1.3.1
            在完成注册流程时，您应当按照法律法规要求，按相应页面的提示准确提供并及时更新您的姓名、联系电话、身份证等信息，以使之真实、及时，完整和准确。如有合理理由怀疑您提供的信息错误、不实、过时或不完整的，本公司有权向您发出询问及/或要求改正的通知，并有权直接做出删除相应资料的处理，直至中止、终止对您提供部分或全部服务。本公司对此不承担任何责任，您将承担因此产生的任何直接或间接损失及不利后果。<br />
            2.1.3.2
            您应当准确填写并及时更新您提供的联系电话、电子邮件地址、QQ等信息，以便本公司或其他会员与您进行有效联系，因通过这些联系方式无法与您取得联系，导致您在使用本服务过程中产生任何损失或增加费用的，应由您完全独自承担。您了解并同意，您有义务保持您提供的联系方式的有效性，如有变更需要更新的，您应按本公司的要求进行操作。<br />
            2.2 账户安全<br />
            2.2.1
            您须自行负责对您的用户名和密码保密，且须对您在该用户名和密码下发生的所有活动（包括但不限于信息披露、发布信息、网上点击同意或提交各类规则协议、网上续签协议或购买服务等）承担责任。您同意：(a)如发现任何人未经授权使用您的用户名和密码，或发生违反保密规定的任何其他情况，您会立即通知本公司，并授权本公司作出处理；及(b)确保您在每个上网时段结束时，以正确步骤离开网站。本公司不能也不会对因您未能遵守本款规定而发生的任何损失或损毁负责。您理解本公司对您的请求采取行动需要合理时间，本公司对在采取行动前已经产生的后果（包括但不限于您的任何损失）不承担任何责任。除非有法律规定或司法裁定，且征得本公司的同意，否则，您的用户名和密码不得以任何方式转让、赠与或继承（与账户相关的财产权益除外）。<br />
            2.2.2
            因他人未经授权使用您的用户名和密码造成的损失由您自行承担或依法由擅用人承担，本网站尽力保证您的账户安全但不保证您账户安全的绝对性。<br />
            2.3 账户注销<br />
            2.3.1
            本公司拥有在您违反国家、地方法律法规规定或违反本服务条款的情况下中止或终止为您提供服务并删除您账户相关信息的权利。<br />
            2.3.2.您同意并授权本网站，您在本网站有欺诈、侵犯他人合法权益、违法违规或其他严重违反任意本网站规则的行为，本网站对此有权披露，您的账户可能注销，不能再登录本网站，本网站服务同时终止。<br />
            2.3.3您同意并授权本网站，您在本网站有欺诈、侵犯他人合法权益、违法违规或其他严重违反任意本网站规则的行为，本网站收到第三人对您的投诉、举报，在本网站获得初步证据或经核实，对此有权披露，您的账户可能注销，不能再登录本网站，本网站服务同时终止。<br />
          </p>
          <h3>3. 您的权利和义务</h3>
          <p>
            3.1
            您有权利享受维鹰云提供的互联网技术和信息服务，并有权利在接受维鹰云提供的服务时获得维鹰云的技术支持、咨询等服务，服务内容详见aiops.yz-intelligence.com网站。<br />
            3.2 您保证不会利用技术或其他手段破坏或扰乱本网站及维鹰云其他客户的网站。<br />
            3.3
            您应尊重本公司及其他第三方的知识产权和其他合法权利，并保证在发生侵犯上述权益的违法事件时尽力保护本公司及其股东、雇员、合作伙伴等免于因该等事件受到影响或损失；本公司保留您侵犯本公司合法权益时终止向您提供服务、删除您的账户信息并不退还任何款项的权利。<br />
            3.4
            对由于您向aiops.yz-intelligence.com提供的联络方式有误以及您用于接受aiops.yz-intelligence.com邮件的电子邮箱安全性、稳定性不佳而导致的一切后果，您应自行承担责任，包括但不限于因您未能及时收到aiops.yz-intelligence.com的相关通知而导致的后果和损失。<br />
            3.5
            在您使用本服务时，本公司有权依照相应的服务收费介绍、订单及/或相关协议向您收取服务费用。本公司拥有制订及调整服务费之权利，具体服务费用以您使用本服务时页面上所列之收费方式公告或您与本公司达成的其他书面协议为准。<br />
            3.6
            您应当及时了解您所购买的服务的实时情况，本公司可能会以电子邮件（或发送到您手机的短信或电话等）方式通知您服务进展情况以及提示您进行下一步的操作，但本公司不保证您能够收到或者及时收到该邮件（或发送到该手机的短信或电话等），且对此本公司不承担任何后果。因此，在服务过程中您应当及时登录到本网站查看和进行交易操作。因您没有及时查看和对服务状态进行修改或确认或未能提交相关申请而导致的任何纠纷或损失，本公司不负任何责任。<br />
            3.7 您授权本公司可以通过向第三方审核您的身份和资格，并取得您使用本服务的相关资料。<br />
            3.8
            您保证您使用本服务时将遵从国家、地方法律法规、行业惯例和社会公共道德，不会利用本公司提供的服务进行发布、传播如下信息和内容：违反国家法律法规政策的任何内容（信息）；违反国家规定的政治宣传和/或新闻信息；涉及国家秘密和/或安全的信息；封建迷信和/或淫秽、色情、下流的信息或教唆犯罪的信息；博彩有奖、赌博游戏；违反国家民族和宗教政策的信息；防碍互联网运行安全的信息；侵害他人合法权益的信息和/或其他有损于社会秩序、社会治安、公共道德的信息或内容。您同时承诺不得为他人发布上述不符合国家规定和/或本服务条款约定的信息内容提供任何便利，包括但不限于设置URL、BANNER链接等。您承认本公司有权在您违反上述约定时有权终止向您提供服务、删除您的账户信息并不予退还任何款项，因您上述行为给本公司造成损失的，您应予赔偿。<br />
            3.9 充值后不支持退款，充值本金及返现金额永久有效，后期产生消费优先扣除本金。<br />
          </p>
          <h3>4. 维鹰云的权利和义务</h3>
          <p>
            4.1 本网站应根据您选择的服务以及交纳款项的情况向您提供合格的网络技术和信息服务。<br />
            4.2 本网站承诺对您账户信息采取对外保密措施，不向第三方披露您资料，不授权第三方使用您资料，除非：<br />
            4.2.1 依据本协议条款或者您与本公司之间其他服务协议、合同、在线条款等规定可以提供；<br />
            4.2.2 依据法律法规的规定应当提供；<br />
            4.2.3 行政、司法等职权部门要求本公司提供；<br />
            4.2.4 您同意本公司向第三方提供；<br />
            4.2.5 本公司解决投诉、举报事件、提起诉讼而提交的；<br />
            4.2.6 本公司为防止严重违法行为或涉嫌犯罪行为发生而采取必要合理行动所必须提交的；<br />
            4.2.7
            本公司为向您提供产品、服务、信息而向第三方提供的，包括本公司通过第三方的技术及服务向您提供产品、服务、信息的情况。<br />
          </p>
          <h3>5. 隐私及其他个人信息的保护</h3>
          <p>
            一旦您同意本协议或使用本服务，您即同意本公司按照以下条款来使用和披露您的个人信息。<br />
            5.1 登录邮箱和密码<br />
            在您注册账户时，我们会要求您设置登录邮箱和密码来识别您的身份，您在丢失密码时可通过邮箱验证找回。您仅可通过您设置的密码来使用该账户，如果您泄漏了密码，您可能会丢失您的个人识别信息，并可能导致对您不利的法律后果。该账户和密码因任何原因受到潜在或现实危险时，您应该立即和本公司取得联系，在本公司采取行动前，本公司对此不负任何责任。<br />
            5.2 用户信息<br />
            您完成账户注册或申请时，应向本公司提供您的真实姓名、网站域名、电话号码和电子邮件地址等信息。为有针对性地向您提供新的服务和机会，您了解并同意本公司及其关联公司或您登录的其他网站将通过您的电子邮件地址或该手机通知您这些信息。<br />
            5.3 登录记录<br />
            为了保障您使用本服务的安全以及不断改进服务质量，本公司将记录并保存您登录和使用本服务的相关信息，但本公司承诺不将此类信息提供给任何第三方（除双方另有约定或法律法规另有规定及本公司关联公司外）。<br />
            5.4 广告<br />
            本公司会对aiops.yz-intelligence.com用户的身份数据进行综合统计，并出于销售和奖励的需要使用或披露。<br />
            5.5 服务信息的收集和存储<br />
            出于 a.提供服务必须收集，否则服务无法提供，和
            b.改善我们的产品和服务，以期更好地满足您的需求，为您提供定制化服务，否则您的产品或者服务体验相对会弱化的目的，本公司有可能自动从您的智能终端（包括手机、电脑和电视等）和浏览器上收集和存储您的软件信息、硬件信息、您主动上传至本网站服务器的信息及您使用偏好信息，上述信息包括但不限于您的操作系统信息，浏览器信息，IP地址，Cookie信息等位置服务使用情况，您所访问的页面等信息。<br />
            5.6 外部链接<br />
            本网站含有到其他网站的链接，但本公司对其他网站的隐私保护措施不负任何责任。本公司可能在任何需要的时候增加商业伙伴或共用品牌的网站。<br />
            5.7 安全<br />
            本公司仅按现有技术提供相应的安全措施来使本公司掌握的信息不丢失，不被滥用和变造。这些安全措施包括向其他服务器备份数据和对用户密码加密。尽管有这些安全措施，但本公司不保证这些信息的绝对安全。<br />
            5.8 使用<br />
            5.8.1
            本公司会将依法收集到的您的个人信息用于审计、数据分析、研究和关联公司之间分享等内部目的，这样您可以更好地享受到本公司为您提供的全面服务，本公司也可以改进本公司的产品与服务。<br />
            5.8.2
            视具体情况，本公司会向与本公司合作提供产品和服务或者帮助本公司向客户进行营销的合作伙伴提供某些个人信息。本公司只会为提供或改进本公司的产品、服务和广告宣传之目的而与第三方共享个人信息；而不会为第三方的营销目的与第三方共享个人信息，更不会销售个人信息。本公司有义务要求上述合作伙伴严格遵守保密约定。<br />
          </p>
          <h3>6. 不可抗力</h3>
          <p>
            6.1
            本条所称“不可抗力”是指不能预见、不能避免或不能克服的客观事件，包括但不限于自然灾害如洪水、火灾、爆炸、雷电、地震和风暴等以及社会事件如基础电信运营商网络出现严重电力或网络故障，战争、动乱、政府行为、国家政策的突然变动和罢工等。
          </p>
          <h3>7. 系统中断或故障</h3>
          <p>
            系统可能因下列状况无法正常运作，使您无法使用各项联网服务时，本公司不承担损害赔偿责任，该状况包括但不限于：<br />
            7.1 本公司在系统停机维护期间。<br />
            7.2 电信设备出现故障不能进行数据传输的。<br />
            7.3 因台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力之因素，造成本公司系统障碍不能执行业务的。<br />
            7.4 由于黑客攻击、电信部门技术调整或故障、网站升级、银行方面的问题等原因而造成的服务中断或者延迟。<br />
          </p>
          <h3>8. 责任范围及责任限制</h3>
          <p>
            8.1 本公司仅对本协议中列明的责任承担范围负责。<br />
            8.2 本公司之合作单位，所提供之服务品质及内容由该合作单位自行负责。<br />
            8.3
            在法律允许的情况下，本公司对于与本协议有关或由本协议引起的任何间接的、惩罚性的、特殊的、派生的损失（包括业务损失、收益损失、利润损失、使用数据或其他经济利益的损失），不论是如何产生的，也不论是由对本协议的违约（包括违反保证）还是由侵权造成的，均不负有任何责任，即使事先已被告知此等损失的可能性。另外即使本协议规定的排他性救济没有达到其基本目的，也应排除本公司对上述损失的责任。<br />
            8.4
            除本协议另有规定外，在任何情况下，您同意本公司对本协议所承担的赔偿责任总额不超过向您收取的当次服务费用总额。<br />
          </p>
          <h3>9. 完整协议</h3>
          <p>
            本协议由本协议条款与本网站公示的各项规则组成，相关名词可互相引用参照，如有不同理解，以本协议条款为准。<br />
            您对本协议理解和认同，您即对本协议所有组成部分的内容理解并认同，一旦您使用本服务，您和本公司即受本协议所有组成部分的约束。<br />
            本协议部分内容若被有管辖权的法院认定为违法的，不影响其他内容的效力。<br />
          </p>
          <h3>10. 商标、知识产权的保护</h3>
          <p>
            10.1
            除第三方产品或服务外，本网站上所有内容，包括但不限于著作、图片、档案、资讯、资料、架构、页面设计，均由本公司或本公司关联企业依法拥有其知识产权，包括但不限于商标权、专利权、著作权、商业秘密等。<br />
            10.2
            非经本公司或本公司关联企业书面同意，任何人不得擅自使用、修改、复制、公开传播、改变、散布、发行或公开发表本网站上程序或内容。<br />
            10.3 尊重知识产权是您应尽的义务，如有违反，您应承担损害赔偿责任。<br />
          </p>
          <h3>11. 法律适用与管辖</h3>
          <p>
            本协议之效力、解释、变更、执行与争议解决均适用中华人民共和国法律。因本协议产生之争议，均应依照中华人民共和国法律予以处理，并提交本公司所在地法院审理。
          </p>
        </div>
      </section>
      <footer class="term-footer">
        <el-button type="primary" size="small" @click="showTerms = false">我知道了</el-button>
      </footer>
    </div>
  </div>
</template>

<script>
import Clickoutside from 'element-ui/src/utils/clickoutside'
export default {
  name: 'Term',
  directives: { Clickoutside },
  props: {
    visible: { type: Boolean, default: false }
  },
  data() {
    return {
      showTerms: this.visible
    }
  },
  watch: {
    visible(val) {
      this.showTerms = val
    },
    showTerms(val) {
      this.$emit('update:visible', val)
    }
  },
  methods: {
    closeTerm() {
      this.showTerms = false
    }
  }
}
</script>
<style lang="scss" scoped>
.term {
  position: relative;
  top: 50%;
  left: 50%;
  transform: translate(-50%, -50%);
  width: 604px;
  border-radius: 8px;
  color: #333;
  background-color: #fff;
  &-wrap {
    position: fixed;
    top: 0;
    bottom: 0;
    left: 0;
    right: 0;
    margin: auto;
    z-index: 2001;
    background-color: rgba(0, 0, 0, 0.5);
  }
  &-header {
    padding: 24px;
    display: flex;
    align-items: center;
    justify-content: space-between;
    color: #000;
    font-size: 16px;
    box-shadow: inset 0 -1px 0 0 #ebedf0;
    &-close {
      @include flex();
      width: 32px;
      height: 32px;
      cursor: pointer;
      &--icon {
        width: 14px;
        height: 14px;
      }
    }
  }
  &-section {
    padding: 24px;
    max-height: 380px;
    overflow: auto;
    line-height: 1.7;
    h3:nth-of-type(n + 2) {
      padding: 10px 0;
    }
  }
  &-footer {
    @include flex(flex-end, center);
    box-shadow: 0 -1px 2px 0 #ebedf0;
    padding: 24px;
  }
}
</style>
